[M_I'm scaredApprentice MissionDefinition]
MissionName="The new clip is ready"
MissionDescription="Complete with a beard and shoulder straps, Comb decided to try his hand at being a wizard. You have to stop and look at the shot with your finger or something.."
TurnInDescription="Magic even in pictures."
MissionSummary="Even despite Zhelezyaka's incredible magical abilities.."
MissionGiver="Claptrap"
MissionTurnInLocation="Claptrap"
TeaserText="This can be confusing when clapping."

[M_ClaptrapApprentice:FinishOffBrooms MissionObjectiveDefinition]
ProgressMessage="Your language"

[M_ClaptrapApprentice:FollowClaptrap MissionObjectiveDefinition]
ProgressMessage="Pay attention to your feelings."

[M_ClaptrapApprentice:KillBadAssGiantFireBrooms MissionObjectiveDefinition]
ProgressMessage="Turn off the cleaner"

[M_ClaptrapApprentice:KillBrooms MissionObjectiveDefinition]
ProgressMessage="Hack Answer"

[M_ClaptrapApprentice:KillFireBrooms MissionObjectiveDefinition]
ProgressMessage="Hit the burning broom"

[M_ClaptrapApprentice:KillGiantFireBrooms MissionObjectiveDefinition]
ProgressMessage="Defeat non-living with large flames"

[M_ClaptrapApprentice:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ClaptrapApprentice:ObjSet_FinishOffBrooms MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ClaptrapApprentice:ObjSet_FollowClaptrap MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ClaptrapApprentice:ObjSet_KillBadAssGiantFireBrooms MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ClaptrapApprentice:ObjSet_KillBrooms MissionObjectiveSetDefinition]
MissionSummaryOverride="Get off this scumbag."
MissionDescriptionOverride="With his beard and staff at the ready, Claptrap finally decides to try his magic..<br>Claptrap tries to summon a giant monster to fight him. But he deliberately asked for a broom as it was more useful than armour. Better to destroy them.."

[M_ClaptrapApprentice:ObjSet_KillFireBrooms MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ClaptrapApprentice:ObjSet_KillGiantFireBrooms MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_ClaptrapApprentice:WitnessMagic MissionObjectiveDefinition]
ProgressMessage="Behold a miracle"

